CREATE TABLE gos_fin_2 (
    name TEXT,
    consolidated_budget_2023 NUMERIC(15,1),
    federal_budget_2023 NUMERIC(15,1),
    regional_budgets_2023 NUMERIC(15,1),
    consolidated_budget_pct_to_2022 NUMERIC(6,1),
    federal_budget_pct_to_2022 NUMERIC(6,1),
    regional_budgets_pct_to_2022 NUMERIC(6,1)
);

INSERT INTO gos_fin_2 (
    name,
    consolidated_budget_2023,
    federal_budget_2023,
    regional_budgets_2023,
    consolidated_budget_pct_to_2022,
    federal_budget_pct_to_2022,
    regional_budgets_pct_to_2022
) VALUES
('Всего', 36182.8, 19637.7, 16545.1, 107.7, 101.1, 116.9),
('налог на прибыль организаций', 7922.4, 1918.6, 6003.8, 124.6, 114.9, 128.1),
('налог на доходы физических лиц', 6537.8, 159.5, 6378.3, 114.1, 107.0, 114.3),
('налог на добавленную стоимость на товары (работы, услуги)', 7792.2, 7792.2, NULL, 113.1, 113.1, NULL),
('из него налог на добавленную стоимость на товары (работы, услуги), реализуемые на территории Российской Федерации', 7182.4, 7182.4, NULL, 110.7, 110.7, NULL),
('акцизы по подакцизным товарам (продукции), производимым на территории Российской Федерации', -677.0, -1866.6, 1189.6, NULL, NULL, 106.5),
('налоги на имущество', 1683.1, NULL, 1683.1, 103.1, NULL, 103.1),
('налоги, сборы и регулярные платежи за пользование природными ресурсами', 11241.9, 11041.8, 200.1, 88.5, 87.8, 151.3),
('из них налог на добычу полезных ископаемых', 9880.9, 9701.2, 179.7, 90.1, 89.5, 140.7);