CREATE TABLE IF NOT EXISTS innovative_technologies_2_2_T(Year INTEGER UNIQUE,
Разработанные_передовые_производ INTEGER,
Проектирование_и_инжиниринг INTEGER,
Производство_обработка_транс INTEGER,
Технологии_автоматизированно INTEGER,
Связь_управление_и_геоматика INTEGER,
Производственная_информацион INTEGER,
Технологии_промышленных_вычи INTEGER,
Зеленые_технологии INTEGER,
Передовые_методы_организации INTEGER);


INSERT INTO innovative_technologies_2_2_T (Year, "Разработанные_передовые_производ", "Проектирование_и_инжиниринг", "Производство_обработка_транс", "Технологии_автоматизированно", "Связь_управление_и_геоматика", "Производственная_информацион", "Технологии_промышленных_вычи", "Зеленые_технологии", "Передовые_методы_организации") VALUES
(2020, 1989, 349, 638, 142, 273, 190, 187, 91, 119),
(2021, 2186, 438, 658, 131, 189, 256, 241, 131, 142),
(2022, 2621, 483, 772, 160, 237, 333, 318, 129, 189),
(2023, 2743, 409, 930, 177, 226, 330, 374, 134, 163),
(2024, 2725, 414, 895, 185, 196, 334, 448, 119, 134);