CREATE TABLE IF NOT EXISTS innovative_technologies_1_1_T (Year INTEGER UNIQUE,
Разработанные_передовые_производ INTEGER,
Проектирование_и_инжиниринг INTEGER,
Производство_обработка_и_сбо INTEGER,
Автоматизированная_транспортиров INTEGER,
Аппаратура_автоматизированно INTEGER,
Связь_и_управление INTEGER,
Производственная_информацион INTEGER,
Интегрированное_управление_и INTEGER);


INSERT INTO innovative_technologies_1_1_T (Year, "Разработанные_передовые_производ", "Проектирование_и_инжиниринг", "Производство_обработка_и_сбо", "Автоматизированная_транспортиров", "Аппаратура_автоматизированно", "Связь_и_управление", "Производственная_информацион", "Интегрированное_управление_и") VALUES
(2000, 688, 165, 281, 20, 76, 90, 18, 38),
(2005, 637, 138, 291, 9, 91, 57, 21, 30),
(2006, 735, 148, 362, 13, 97, 56, 24, 35),
(2007, 780, 177, 365, 8, 110, 67, 14, 39),
(2008, 787, 173, 369, 14, 99, 68, 23, 41),
(2009, 789, 196, 328, 21, 102, 67, 26, 49),
(2010, 864, 216, 383, 18, 116, 70, 20, 41),
(2011, 1138, 316, 405, 24, 128, 154, 51, 60),
(2012, 1323, 305, 548, 23, 121, 204, 60, 62),
(2013, 1429, 426, 517, 22, 137, 206, 68, 53),
(2014, 1409, 445, 506, 22, 110, 202, 65, 59),
(2015, 1398, 359, 548, 12, 117, 232, 84, 46),
(2016, 1534, 402, 509, 34, 160, 285, 83, 61),
(2017, 1402, 417, 485, 34, 134, 218, 44, 70),
(2018, 1565, 458, 492, 40, 165, 292, 72, 46),
(2019, 1620, 456, 510, 29, 159, 316, 81, 69);