CREATE TABLE organization_financial_assets_1 (
    category TEXT,
    year INT,
    value DECIMAL(20, 1)
);

INSERT INTO organization_financial_assets_1 (category, year, value) VALUES
('Число акционерных обществ, единиц', 2003, 24137.0),
('Число акционерных обществ, единиц', 2005, 21994.0),
('Число акционерных обществ, единиц', 2008, 17512.0),
('Число акционерных обществ, единиц', 2010, 15787.0),
('Число акционерных обществ, единиц', 2012, 19467.0),
('Число акционерных обществ, единиц', 2014, 18523.0),
('Число акционерных обществ, единиц', 2017, 15276.0),
('Число акционерных обществ, единиц', 2020, 13556.0),
('Число акционерных обществ, единиц', 2023, 13475.0),

('публичные акционерные общества(открытые акционерные общества)', 2003, 14959.0),
('публичные акционерные общества(открытые акционерные общества)', 2005, 12916.0),
('публичные акционерные общества(открытые акционерные общества)', 2008, 9959.0),
('публичные акционерные общества(открытые акционерные общества)', 2010, 8845.0),
('публичные акционерные общества(открытые акционерные общества)', 2012, 11394.0),
('публичные акционерные общества(открытые акционерные общества)', 2014, 10693.0),
('публичные акционерные общества(открытые акционерные общества)', 2017, 4524.0),
('публичные акционерные общества(открытые акционерные общества)', 2020, 2735.0),
('публичные акционерные общества(открытые акционерные общества)', 2023, 1821.0),

('непубличные акционерные общества (закрытые акционерные общества)', 2003, 9178.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2005, 9078.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2008, 7553.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2010, 6942.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2012, 8073.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2014, 7830.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2017, 10752.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2020, 10821.0),
('непубличные акционерные общества (закрытые акционерные общества)', 2023, 11654.0);