CREATE TABLE financial_investments_2 (
    level_0 VARCHAR(255),
    level_1 VARCHAR(255),
    level_2 VARCHAR(255),
    level_3 VARCHAR(255),
    received_total NUMERIC(18,1),
    received_long NUMERIC(18,1),
    received_short NUMERIC(18,1),
    accumulated_total NUMERIC(18,1),
    accumulated_long NUMERIC(18,1),
    accumulated_short NUMERIC(18,1)
);

INSERT INTO financial_investments_2 (level_0, level_1, level_2, level_3, received_total, received_long, received_short, accumulated_total, accumulated_long, accumulated_short) VALUES
-- Корневой уровень
('Всего', 'Всего', 'Всего', 'Всего', 881195.2, 64662.3, 816532.9, 209223.0, 157500.3, 51722.7),

-- Сельское, лесное хозяйство
('Всего', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 7540.3, 301.8, 7238.5, 1517.7, 809.0, 708.7),
('Всего', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 'растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях', 'растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях', 6354.9, 225.7, 6129.2, 1170.5, 555.5, 615.0),
('Всего', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 'лесоводство и лесозаготовки', 'лесоводство и лесозаготовки', 46.9, 0.7, 46.2, 32.1, 27.5, 4.6),
('Всего', 'Сельское, лесное хозяйство, охота, рыболовство и рыбоводство', 'рыболовство и рыбоводство', 'рыболовство и рыбоводство', 1138.5, 75.4, 1063.1, 315.1, 226.0, 89.1),

-- Добыча полезных ископаемых
('Всего', 'Добыча полезных ископаемых', 'Добыча полезных ископаемых', 'Добыча полезных ископаемых', 34873.1, 13558.6, 21314.5, 17362.4, 12442.7, 4919.7),
('Всего', 'Добыча полезных ископаемых', 'добыча угля', 'добыча угля', 831.8, 230.8, 601.0, 574.2, 447.4, 126.8),
('Всего', 'Добыча полезных ископаемых', 'добыча нефти и природного газа', 'добыча нефти и природного газа', 21623.5, 9895.6, 11727.9, 9941.6, 6585.1, 3356.5),
('Всего', 'Добыча полезных ископаемых', 'добыча металлических руд', 'добыча металлических руд', 6663.4, 3007.9, 3655.5, 5728.0, 4840.7, 887.3),
('Всего', 'Добыча полезных ископаемых', 'добыча прочих полезных ископаемых', 'добыча прочих полезных ископаемых', 1594.3, 36.8, 1557.5, 346.1, 178.5, 167.6),

-- Обрабатывающие производства
('Всего', 'Обрабатывающие производства', 'Обрабатывающие производства', 'Обрабатывающие производства', 148671.5, 8182.2, 140489.3, 32927.1, 26345.6, 6581.5),
('Всего', 'Обрабатывающие производства', 'производство пищевых продуктов', 'производство пищевых продуктов', 8569.0, 239.2, 8329.8, 1148.8, 552.1, 596.7),
('Всего', 'Обрабатывающие производства', 'производство напитков', 'производство напитков', 3042.5, 79.3, 2963.2, 247.6, 121.2, 126.4),
('Всего', 'Обрабатывающие производства', 'производство табачных изделий', 'производство табачных изделий', 13.0, 0.0, 13.0, 29.3, 28.3, 1.0),
('Всего', 'Обрабатывающие производства', 'производство текстильных изделий', 'производство текстильных изделий', 251.9, 5.7, 246.2, 29.6, 9.8, 19.8),
('Всего', 'Обрабатывающие производства', 'производство одежды', 'производство одежды', 267.0, 2.4, 264.6, 27.4, 8.3, 19.1),
('Всего', 'Обрабатывающие производства', 'производство кожи и изделий из кожи', 'производство кожи и изделий из кожи', 142.7, 0.1, 142.6, 8.1, 1.2, 6.9),
('Всего', 'Обрабатывающие производства', 'обработка древесины и производство изделий из дерева и пробки, кроме мебели', 'обработка древесины и производство изделий из дерева и пробки, кроме мебели', 630.3, 35.9, 594.4, 168.7, 97.1, 71.6),
('Всего', 'Обрабатывающие производства', 'производство бумаги и бумажных изделий', 'производство бумаги и бумажных изделий', 3227.6, 28.2, 3199.4, 190.7, 85.4, 105.3),
('Всего', 'Обрабатывающие производства', 'деятельность полиграфическая и копирование носителей информации', 'деятельность полиграфическая и копирование носителей информации', 847.7, 1.8, 845.9, 55.2, 10.3, 44.9),
('Всего', 'Обрабатывающие производства', 'производство кокса и нефтепродуктов', 'производство кокса и нефтепродуктов', 66559.7, 3655.9, 62903.8, 14226.5, 12651.1, 1575.4),
('Всего', 'Обрабатывающие производства', 'производство кокса и нефтепродуктов', 'производство кокса', 69.0, 1.0, 68.0, 32.3, 29.7, 2.6),
('Всего', 'Обрабатывающие производства', 'производство кокса и нефтепродуктов', 'производство нефтепродуктов', 66488.7, 3654.9, 62833.8, 14194.2, 12621.4, 1572.8),
('Всего', 'Обрабатывающие производства', 'производство химических веществ и химических продуктов', 'производство химических веществ и химических продуктов', 11555.5, 587.5, 10968.0, 3888.9, 3065.3, 823.6),
('Всего', 'Обрабатывающие производства', 'производство лекарственных средств и материалов, применяемых в медицинских целях', 'производство лекарственных средств и материалов, применяемых в медицинских целях', 3874.3, 24.7, 3822.6, 208.3, 100.5, 107.8),
('Всего', 'Обрабатывающие производства', 'производство резиновых и пластмассовых изделий', 'производство резиновых и пластмассовых изделий', 2223.7, 43.5, 2180.2, 222.6, 133.5, 89.1),
('Всего', 'Обрабатывающие производства', 'производство прочей неметаллической минеральной продукции', 'производство прочей неметаллической минеральной продукции', 3081.5, 240.8, 2840.7, 604.3, 325.9, 278.4),
('Всего', 'Обрабатывающие производства', 'производство металлургическое', 'производство металлургическое', 16103.0, 2713.8, 13389.2, 7948.4, 6941.7, 1006.7),
('Всего', 'Обрабатывающие производства', 'производство готовых металлических изделий, кроме машин и оборудования', 'производство готовых металлических изделий, кроме машин и оборудования', 5273.8, 56.4, 5217.4, 707.6, 398.1, 309.5),
('Всего', 'Обрабатывающие производства', 'производство компьютеров, электронных и оптических изделий', 'производство компьютеров, электронных и оптических изделий', 4314.6, 15.5, 4299.1, 419.1, 124.9, 294.5),
('Всего', 'Обрабатывающие производства', 'производство электрического оборудования', 'производство электрического оборудования', 2574.0, 52.5, 2521.5, 197.7, 71.1, 126.6),
('Всего', 'Обрабатывающие производства', 'производство машин и оборудования, не включенных в другие группировки', 'производство машин и оборудования, не включенных в другие группировки', 5313.2, 28.0, 5285.2, 382.4, 133.4, 249.0),
('Всего', 'Обрабатывающие производства', 'производство автотранспортных средств, прицепов и полуприцепов', 'производство автотранспортных средств, прицепов и полуприцепов', 5170.8, 37.4, 5133.4, 386.5, 152.8, 233.7),
('Всего', 'Обрабатывающие производства', 'производство прочих транспортных средств и оборудования', 'производство прочих транспортных средств и оборудования', 3197.6, 305.9, 2891.7, 1529.1, 1244.8, 284.3),
('Всего', 'Обрабатывающие производства', 'производство мебели', 'производство мебели', 239.2, 2.1, 237.1, 55.8, 2.1, 53.7),
('Всего', 'Обрабатывающие производства', 'производство прочих готовых изделий', 'производство прочих готовых изделий', 409.7, 15.9, 393.8, 44.8, 28.8, 16.0),

-- Обеспечение электроэнергией, газом и паром
('Всего', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 26131.7, 760.3, 25371.4, 4485.3, 2821.5, 1663.8),
('Всего', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 'производство, передача и распределение электроэнергии', 'производство, передача и распределение электроэнергии', 23917.4, 486.3, 23431.1, 4065.0, 2579.3, 1485.7),
('Всего', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 'производство и распределение газообразного топлива', 'производство и распределение газообразного топлива', 1190.8, 256.3, 934.5, 189.5, 84.5, 105.0),
('Всего', 'Обеспечение электрической энергией, газом и паром; кондиционирование воздуха', 'производство, передача и распределение пара и горячей воды; кондиционирование воздуха', 'производство, передача и распределение пара и горячей воды; кондиционирование воздуха', 1023.5, 17.7, 1005.8, 230.8, 157.7, 73.1),

-- Водоснабжение
('Всего', 'Водоснабжение; водоотведение, организация сбора и утилизации отходов, деятельность по ликвидации загрязнений', 'Водоснабжение; водоотведение, организация сбора и утилизации отходов, деятельность по ликвидации загрязнений', 'Водоснабжение; водоотведение, организация сбора и утилизации отходов, деятельность по ликвидации загрязнений', 1574.7, 32.7, 1542.0, 147.2, 35.5, 111.7),

-- Строительство
('Всего', 'Строительство', 'Строительство', 'Строительство', 23496.9, 417.7, 23079.2, 2509.5, 980.2, 1529.3),
('Всего', 'Строительство', 'строительство зданий', 'строительство зданий', 11728.6, 287.9, 11440.7, 1748.7, 754.3, 994.4),
('Всего', 'Строительство', 'строительство инженерных сооружений', 'строительство инженерных сооружений', 7817.0, 121.5, 7695.5, 554.8, 190.0, 364.8),

-- Торговля
('Всего', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 119637.0, 3973.6, 115663.4, 18318.9, 12861.6, 5457.3),
('Всего', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 'торговля оптовая и розничная автотранспортными средствами и мотоциклами и их ремонт', 'торговля оптовая и розничная автотранспортными средствами и мотоциклами и их ремонт', 13488.7, 361.2, 13127.5, 824.6, 322.4, 502.2),
('Всего', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 'торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами', 'торговля оптовая, кроме оптовой торговли автотранспортными средствами и мотоциклами', 79878.9, 1566.6, 78312.3, 14193.0, 10464.6, 3728.4),
('Всего', 'Торговля оптовая и розничная; ремонт автотранспортных средств и мотоциклов', 'торговля розничная, кроме торговли автотранспортными средствами и мотоциклами', 'торговля розничная, кроме торговли автотранспортными средствами и мотоциклами', 26269.4, 2045.8, 24223.6, 3301.3, 2074.6, 1226.7),

-- Транспортировка и хранение
('Всего', 'Транспортировка и хранение', 'Транспортировка и хранение', 'Транспортировка и хранение', 25353.7, 410.4, 24943.3, 4309.2, 2761.1, 1548.1),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность сухопутного и трубопроводного транспорта', 7624.9, 223.4, 7401.5, 2441.4, 1778.4, 663.0),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность железнодорожного транспорта: междугородные и международные пассажирские перевозки', 15.8, 0.0, 15.8, 3.8, 1.2, 2.6),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность железнодорожного транспорта: грузовые перевозки', 4466.8, 50.0, 4416.8, 1125.8, 806.9, 318.9),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность прочего сухопутного пассажирского транспорта', 966.2, 57.9, 908.3, 153.0, 132.2, 20.8),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность автомобильного грузового транспорта и услуги по перевозкам', 1499.0, 37.4, 1461.6, 143.3, 34.9, 108.4),
('Всего', 'Транспортировка и хранение', 'деятельность сухопутного и трубопроводного транспорта', 'деятельность трубопроводного транспорта', 677.1, 78.1, 599.0, 1015.5, 803.2, 212.3),
('Всего', 'Транспортировка и хранение', 'деятельность водного транспорта', 'деятельность водного транспорта', 1053.2, 15.5, 1037.7, 121.9, 51.6, 70.3),
('Всего', 'Транспортировка и хранение', 'деятельность воздушного и космического транспорта', 'деятельность воздушного и космического транспорта', 5770.4, 5.4, 5765.0, 323.8, 94.1, 229.7),
('Всего', 'Транспортировка и хранение', 'складское хозяйство и вспомогательная транспортная деятельность', 'складское хозяйство и вспомогательная транспортная деятельность', 10500.6, 159.6, 10341.0, 1365.8, 795.5, 570.3),
('Всего', 'Транспортировка и хранение', 'деятельность почтовой связи и курьерская деятельность', 'деятельность почтовой связи и курьерская деятельность', 404.6, 6.5, 398.1, 56.3, 41.5, 14.8),

-- Гостиницы и общепит
('Всего', 'Деятельность гостиниц и предприятий общественного питания', 'Деятельность гостиниц и предприятий общественного питания', 'Деятельность гостиниц и предприятий общественного питания', 3678.3, 141.6, 3536.7, 380.5, 221.8, 158.7),
('Всего', 'Деятельность гостиниц и предприятий общественного питания', 'деятельность по предоставлению мест для временного проживания', 'деятельность по предоставлению мест для временного проживания', 1526.8, 65.4, 1461.4, 285.9, 158.8, 127.1),
('Всего', 'Деятельность гостиниц и предприятий общественного питания', 'деятельность по предоставлению продуктов питания и напитков', 'деятельность по предоставлению продуктов питания и напитков', 2151.5, 76.2, 2075.3, 94.6, 63.0, 31.6),

-- Информация и связь
('Всего', 'Деятельность в области информации и связи', 'Деятельность в области информации и связи', 'Деятельность в области информации и связи', 27628.6, 1756.6, 25872.0, 7364.9, 5333.4, 2031.5),
('Всего', 'Деятельность в области информации и связи', 'деятельность издательская', 'деятельность издательская', 732.6, 4.7, 727.9, 25.2, 10.2, 15.0),
('Всего', 'Деятельность в области информации и связи', 'деятельность в сфере телекоммуникаций', 'деятельность в сфере телекоммуникаций', 2050.9, 489.2, 1561.7, 1984.8, 1632.2, 352.6),
('Всего', 'Деятельность в области информации и связи', 'деятельность в области информационных технологий', 'деятельность в области информационных технологий', 4823.6, 127.9, 4695.7, 713.0, 372.5, 340.5),

-- Финансовая и страховая деятельность
('Всего', 'Деятельность финансовая и страховая', 'Деятельность финансовая и страховая', 'Деятельность финансовая и страховая', 357693.9, 23921.1, 333772.8, 71785.7, 55492.8, 16292.9),

-- Операции с недвижимостью
('Всего', 'Деятельность по операциям с недвижимым имуществом', 'Деятельность по операциям с недвижимым имуществом', 'Деятельность по операциям с недвижимым имуществом', 25221.2, 1392.8, 23828.4, 8132.9, 5284.1, 2848.8),

-- Профессиональная, научная и техническая деятельность
('Всего', 'Деятельность профессиональная, научная и техническая', 'Деятельность профессиональная, научная и техническая', 'Деятельность профессиональная, научная и техническая', 56101.0, 8529.1, 47571.9, 30276.0, 23905.9, 6370.1),
('Всего', 'Деятельность профессиональная, научная и техническая', 'научные исследования и разработки', 'научные исследования и разработки', 2080.9, 132.1, 1948.8, 624.3, 438.8, 185.5),

-- Административная деятельность
('Всего', 'Деятельность административная и сопутствующие дополнительные услуги', 'Деятельность административная и сопутствующие дополнительные услуги', 'Деятельность административная и сопутствующие дополнительные услуги', 11507.7, 592.2, 10915.5, 5351.2, 4596.7, 754.5),
('Всего', 'Деятельность административная и сопутствующие дополнительные услуги', 'деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма', 'деятельность туристических агентств и прочих организаций, предоставляющих услуги в сфере туризма', 1851.1, 5.5, 1845.6, 39.2, 7.9, 31.3),

-- Государственное управление
('Всего', 'Государственное управление и обеспечение военной безопасности; социальное обеспечение', 'Государственное управление и обеспечение военной безопасности; социальное обеспечение', 'Государственное управление и обеспечение военной безопасности; социальное обеспечение', 788.7, 481.8, 306.9, 2417.9, 2408.3, 9.6),

-- Образование
('Всего', 'Образование', 'Образование', 'Образование', 2159.9, 37.9, 2122.0, 272.4, 27.6, 244.8),

-- Здравоохранение
('Всего', 'Деятельность в области здравоохранения и социальных услуг', 'Деятельность в области здравоохранения и социальных услуг', 'Деятельность в области здравоохранения и социальных услуг', 1752.1, 90.7, 1661.4, 999.0, 871.1, 127.9),
('Всего', 'Деятельность в области здравоохранения и социальных услуг', 'деятельность в области здравоохранения', 'деятельность в области здравоохранения', 1504.9, 20.9, 1484.0, 180.5, 75.6, 104.9),

-- Культура, спорт, досуг
('Всего', 'Деятельность в области культуры, спорта, организации досуга и развлечений', 'Деятельность в области культуры, спорта, организации досуга и развлечений', 'Деятельность в области культуры, спорта, организации досуга и развлечений', 3488.7, 79.2, 3409.5, 484.1, 273.4, 210.7),
('Всего', 'Деятельность в области культуры, спорта, организации досуга и развлечений', 'деятельность библиотек, архивов, музеев и прочих объектов культуры', 'деятельность библиотек, архивов, музеев и прочих объектов культуры', 27.0, 0.1, 26.9, 8.8, 0.2, 8.6),
('Всего', 'Деятельность в области культуры, спорта, организации досуга и развлечений', 'деятельность в области спорта, отдыха и развлечений', 'деятельность в области спорта, отдыха и развлечений', 2405.1, 13.1, 2392.0, 246.6, 87.4, 159.2),

-- Прочие услуги
('Всего', 'Предоставление прочих видов услуг', 'Предоставление прочих видов услуг', 'Предоставление прочих видов услуг', 3896.2, 2.0, 3894.2, 181.1, 28.0, 153.1);